<?php
namespace Database\Seeders;

use App\Models\Nationality;
use Illuminate\Database\Seeder;


class NationalitiesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
      $nationals = array(
    'أفغاني', 'ألباني', 'جزائري', 'أمريكي', 'أندوري', 'أنغولي', 'أنتيغواني', 'أرجنتيني', 'أرميني', 'أسترالي',
    'نمساوي', 'أذربيجاني', 'باهامي', 'بحريني', 'بنغلاديشي', 'باربادوسي', 'بربودي', 'بوتسواني', 'بيلاروسي', 'بلجيكي',
    'بليزي', 'بنيني', 'بوتاني', 'بوليفي', 'بوسني', 'برازيلي', 'بريطاني', 'بروناي', 'بلغاري', 'بوركيني',
    'بورمي', 'بوروندي', 'كمبودي', 'كاميروني', 'كندي', 'كيب فيردي', 'أفريقي وسطي', 'تشادي', 'تشيلي', 'صيني',
    'كولومبي', 'جزر القمر', 'كونغولي', 'كوستاريكي', 'كرواتي', 'كوبي', 'قبرصي', 'تشيكي', 'دنماركي', 'جيبوتي',
    'دومينيكاني', 'هولندي', 'تيموري شرقي', 'إكوادوري', 'مصري', 'إماراتي', 'غيني استوائي', 'إريتري', 'إستوني', 'إثيوبي',
    'فيجي', 'فلبيني', 'فنلندي', 'فرنسي', 'غابوني', 'غامبي', 'جورجي', 'ألماني', 'غاني', 'يوناني',
    'غرينادي', 'غواتيمالي', 'غيني بيساوي', 'غيني', 'غوياني', 'هايتي', 'هرزغوفي', 'هندوراسي', 'مجري', 'آيسلندي',
    'هندي', 'إندونيسي', 'إيراني', 'عراقي', 'إيرلندي', 'إسرائيلي', 'إيطالي', 'إيفواري', 'جامايكي', 'ياباني',
    'أردني', 'كازاخستاني', 'كيني', 'كيتسي', 'كويتي', 'قيرغيزي', 'لاوسي', 'لاتفي', 'لبناني', 'ليبيري',
    'ليبي', 'ليختنشتايني', 'لتواني', 'لوكسمبورغي', 'مقدوني', 'مدغشقري', 'مالاوي', 'ماليزي', 'مالديفي', 'مالي',
    'مالطي', 'مارشالي', 'موريتاني', 'موريشيوسي', 'مكسيكي', 'ميكرونيزي', 'مولدوفي', 'موناكي', 'منغولي', 'مغربي',
    'موزمبيقي', 'ناميبي', 'ناورو', 'نيبالي', 'نيوزيلندي', 'نيكاراغوي', 'نيجيري', 'نيجري', 'كوري شمالي', 'أيرلندي شمالي',
    'نرويجي', 'عماني', 'باكستاني', 'بالاوي', 'بنمي', 'بابوا غينيا الجديد', 'باراغوي', 'بيروفي', 'بولندي', 'برتغالي',
    'قطري', 'روماني', 'روسي', 'رواندي', 'سانت لوسياني', 'سلفادوري', 'ساموي', 'سان ماريني', 'ساو تومي', 'سعودي',
    'إسكتلندي', 'سنغالي', 'صربي', 'سيشلي', 'سيراليوني', 'سنغافوري', 'سلوفاكي', 'سلوفيني', 'جزر سليمان', 'صومالي',
    'جنوب أفريقي', 'كوري جنوبي', 'إسباني', 'سريلانكي', 'سوداني', 'سورينامي', 'سوازي', 'سويدي', 'سويسري', 'سوري',
    'تايواني', 'طاجيكي', 'تنزاني', 'تايلاندي', 'توغولي', 'تونغي', 'ترينيدادي', 'تونسي', 'تركي', 'توفالي',
    'أوغندي', 'أوكراني', 'أوروغوياني', 'أوزبكي', 'فنزويلي', 'فيتنامي', 'ويلزي', 'يمني', 'زامبي', 'زيمبابوي'
);

        foreach ($nationals as $n) {
            Nationality::create(['name' => $n]);
        }
    }
}
